modules/web/controllers/MemberController.php

SELECT COUNT(*) FROM `member`
SELECT * FROM `member` ORDER BY `id` DESC LIMIT 1
---
    public function actionIndex()
    {
        $mix_kw = trim( $this->get("mix_kw","" ) );
        $status = intval( $this->get("status",ConstantMapService::$status_default ) );
        $p = intval( $this->get("p",1) );
        $p = ( $p > 0 )?$p:1;

        $query = Member::find();

        if( $mix_kw ){
            $where_nickname = [ 'LIKE','nickname','%'.strtr($mix_kw,['%'=>'\%', '_'=>'\_', '\\'=>'\\\\']).'%', false ];
            $where_mobile = [ 'LIKE','mobile','%'.strtr($mix_kw,['%'=>'\%', '_'=>'\_', '\\'=>'\\\\']).'%', false ];
            $query->andWhere([ 'OR',$where_nickname,$where_mobile ]);
        }

        if( $status > ConstantMapService::$status_default ){
            $query->andWhere([ 'status' => $status ]);
        }

        //分页功能,需要两个参数，1：符合条件的总记录数量  2：每页展示的数量
        //60,60 ~ 11,10 - 1
        $page_size=1;
        $total_res_count = $query->count();

        $total_page = ceil( $total_res_count / $page_size );

        $list = $query->orderBy(['id' => SORT_DESC])->offset(($p-1) * $page_size )->limit($page_size)->all( );

SELECT * FROM `member` WHERE `id`=2
---
    public function actionInfo(){
        $id = intval( $this->get("id", 0) );
        $reback_url = UrlService::buildWebUrl("/member/index");
        if( !$id ){
            return $this->redirect( $reback_url );
        }

        $info = Member::find()->where([ 'id' => $id ])->one();

SELECT * FROM `member` WHERE `id`=2
---
    public function actionSet(){
        if( \Yii::$app->request->isGet ) {
            $id = intval( $this->get("id", 0) );
            $info = [];
            if( $id ){
                $info = Member::find()->where([ 'id' => $id ])->one();

SELECT * FROM `member` WHERE `id`='2'
UPDATE `member` SET `status`=0, `updated_time`='2018-02-06 06:05:13' WHERE `id`='2'
---
    public function actionOps(){
        if( !\Yii::$app->request->isPost ){
            return $this->renderJSON( [],ConstantMapService::$default_syserror,-1 );
        }

        $id = $this->post('id',[]);
        $act = trim($this->post('act',''));
        if( !$id ){
            return $this->renderJSON([],"请选择要操作的会员账号号~~",-1);
        }

        if( !in_array( $act,['remove','recover' ])){
            return $this->renderJSON([],"操作有误，请重试~~",-1);
        }

        $info = Member::find()->where([ 'id' => $id ])->one();
        if( !$info ){
            return $this->renderJSON([],"指定会员账号不存在~~",-1);
        }

        switch ( $act ){
            case "remove":
                $info->status = 0;
                break;
            case "recover":
                $info->status = 1;
                break;
        }
        $info->updated_time = date("Y-m-d H:i:s");
        $info->update( 0 );