common/services/applog/AppLogService.php

    public  static function addErrorLog($appname,$content){
        $error = \Yii::$app->errorHandler->exception;
        $model_app_log = new AppLog();
        $model_app_log->app_name = $appname;
        $model_app_log->content = $content;
        //获取ip，$_SERVER['REMOTE_ADDR']
        $model_app_log->ip = UtilService::getIP();

        if(!empty($_SERVER['HTTP_USER_AGENT'])){
            $model_app_log->ua = $_SERVER['HTTP_USER_AGENT'];
        }

        if( $error ){
            $model_app_log->err_code=$error->getCode();
            if( isset( $error->statusCode ) ){
                $model_app_log->http_code = $error->statusCode;
            }

            if( method_exists( $error,"getname") ){
                $model_app_log->err_name = $error->getName();
            }
        }

        $model_app_log->created_time = date( "Y-m-d H:i:s" );
        $model_app_log->save( 0 );
---
INSERT INTO `app_log` (`app_name`, `content`, `ip`, `ua`, `err_code`, `http_code`, `err_name`, `created_time`) VALUES ('basic', 'Page not found.[file:C:\\phpStudy\\PHPTutorial\\WWW\\imooc\\vendor\\yiisoft\\yii2\\web\\Application.php][line:115][code:0][url:][POST_DATA:]', '127.0.0.1', 'Mozilla/5.0 (Windows NT 6.1) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/62.0.3202.94 Safari/537.36', 0, 404, 'Not Found', '2018-02-06 06:05:10')

    public static function addAppAccessLog( $uid = 0 ){

        $get_params = \Yii::$app->request->get();
        $post_params = \Yii::$app->request->post();
        if( isset( $post_params['summary'] ) ){
            unset( $post_params['summary'] );
        }


        $target_url = isset($_SERVER['REQUEST_URI'])?$_SERVER['REQUEST_URI']:'';

        $referer = isset($_SERVER['HTTP_REFERER'])?$_SERVER['HTTP_REFERER']:'';
        $ua = isset($_SERVER['HTTP_USER_AGENT'])?$_SERVER['HTTP_USER_AGENT']:'';

        $access_log = new AppAccessLog();
        $access_log->uid = $uid;
        $access_log->referer_url = $referer?$referer:'';
        $access_log->target_url = $target_url;
        $access_log->query_params = json_encode(array_merge($get_params,$post_params));
        $access_log->ua = $ua?$ua:'';
        $access_log->ip = UtilService::getIP();
        $access_log->created_time = date("Y-m-d H:i:s");
        return $access_log->save(0);
---
INSERT INTO `app_access_log` (`uid`, `referer_url`, `target_url`, `query_params`, `ua`, `ip`, `created_time`) VALUES ('1', 'http://book.imooc.test/web/member/index?p=1', '/web/member/index?p=1', '{\"p\":\"1\"}', 'Mozilla/5.0 (Windows NT 6.1) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/62.0.3202.94 Safari/537.36', '127.0.0.1', '2018-02-06 06:04:28')