modules/web/controllers/common/BaseController.php

SELECT * FROM `user` WHERE `uid`='1'
---
    private function checkLoginStatus(){
        //获取cookie的值
        $auth_cookie=$this->getCookie($this->auth_cookie_name);
        if(!$auth_cookie){
            return false;
        }

        list($auth_token,$uid)=explode("#",$auth_cookie);

        if(!$auth_token || !$uid){
            return false;
        }

        if(!preg_match("/^\d+$/",$uid)){
            return false;
        }

        $user_info=User::find()->where(['uid'=>$uid])->one();